---
kind: method
id: M:Autodesk.Revit.DB.ViewCropRegionShapeManager.RemoveCropRegionShape
source: html/f72964d5-5b22-0d77-2fe0-0c127546d879.htm
---
# Autodesk.Revit.DB.ViewCropRegionShapeManager.RemoveCropRegionShape Method

Removes any non-rectangular boundary of the view's crop.

## Syntax (C#)
```csharp
public void RemoveCropRegionShape()
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The crop of the associated view is not permitted to have a non-rectangular shape.